; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	image1 - mode
	spectrograph0 - mode
	image3 - mode
	infrared2 - mode
	Star2 - direction
	GroundStation4 - direction
	GroundStation0 - direction
	Star1 - direction
	GroundStation3 - direction
	Phenomenon5 - direction
	Star6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 image3)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph0)
	(supports instrument2 image3)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 image3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(supports instrument4 image3)
	(calibration_target instrument4 Star1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star10)
	(supports instrument6 spectrograph0)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star1)
	(supports instrument7 image3)
	(supports instrument7 image1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared2)
	(supports instrument8 image3)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon9)
)
(:goal (and
	(pointing satellite2 Star1)
	(have_image Phenomenon5 infrared2)
	(have_image Star6 image1)
	(have_image Planet7 spectrograph0)
	(have_image Star8 image3)
	(have_image Phenomenon9 spectrograph0)
	(have_image Star10 infrared2)
	(have_image Star11 infrared2)
))

)

; plan
1. (turn_to satellite2 star1 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 star1)
   goals met: 1 of 8
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 8
3. (calibrate satellite2 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 1 of 8
4. (turn_to satellite2 phenomenon9 star1)
   deleted: (pointing satellite2 star1)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 8
5. (take_image satellite2 phenomenon9 instrument6 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite2 phenomenon5 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon5)
   goals met: 1 of 8
7. (turn_to satellite0 star1 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star1)
   goals met: 1 of 8
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 8
9. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 1 of 8
10. (take_image satellite2 phenomenon5 instrument6 infrared2)
   added: (have_image phenomenon5 infrared2)
   goals met: 2 of 8
11. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   goals met: 2 of 8
12. (take_image satellite0 star10 instrument1 infrared2)
   added: (have_image star10 infrared2)
   goals met: 3 of 8
13. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 3 of 8
14. (take_image satellite0 star11 instrument1 infrared2)
   added: (have_image star11 infrared2)
   goals met: 4 of 8
15. (turn_to satellite0 star6 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star6)
   goals met: 4 of 8
16. (take_image satellite0 star6 instrument1 image1)
   added: (have_image star6 image1)
   goals met: 5 of 8
17. (turn_to satellite0 star8 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star8)
   goals met: 5 of 8
18. (take_image satellite0 star8 instrument1 image3)
   added: (have_image star8 image3)
   goals met: 6 of 8
19. (turn_to satellite2 planet7 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet7)
   goals met: 6 of 8
20. (take_image satellite2 planet7 instrument6 spectrograph0)
   added: (have_image planet7 spectrograph0)
   goals met: 7 of 8
21. (turn_to satellite2 star1 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star1)
   goals met: 8 of 8
